Управление_торговлей.ПБТ/src/InformationRegisters/Константы/Константы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Константы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      <types>Boolean</types>
      <types>CatalogRef.ВидыЦен</types>
      <types>CatalogRef.Организации</types>
      <types>String</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/InformationRegisters/Константы/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ЗаполнитьНачальныеНастройкиНаСервере()

	ЗаписатьКонстанту("вт_ВидЦенПлановойСебестоимости", "Вид цен плановой себестоимости", 									Справочники.ВидыЦен.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_ИспользоватьНовыйФорматСводкиПроизводства", "Использовать новый формат сводки производства (вт)", Ложь);	
	ЗаписатьКонстанту("вт_ОрганизацияПроизводства", "Основная организация производства", 									Справочники.Организации.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_ОсновнойСклад", "Основной склад", 																Справочники.Склады.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_ПодразделениеПроизводства", "Подразделение производства", 										Справочники.СтруктураПредприятия.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_СкладБрака", "Склад брака продукции", 															Справочники.Склады.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_СкладПроизводства", "Склад производства, готовой продукции", 										Справочники.Склады.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_СтатьяДоходовПроизводство", "Статья доходов производство", 										ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_СтатьяРасходовЗарплата", "Статья расходов зарплата", 												ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка());	
	ЗаписатьКонстанту("вт_СтатьяРасходовОперации", "Статья расходов операции", 												ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка());	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонстанту(Имя, Представление, Значение)

	МенеджерЗаписи = РегистрыСведений.Константы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Имя = Имя;
	МенеджерЗаписи.Представление = Представление;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачальныеНастройки(Команда)
	ЗаполнитьНачальныеНастройкиНаСервере();
КонецПроцедуры
